{"About":{"title":"Obsidian & Quartz","links":[],"tags":[],"content":"Obsidianとは\nObsidian（オブシディアン）は、Markdown形式を用いた個人のナレッジベースやノート作成のためのソフトウェアアプリケーションです。主に以下の特徴があります。\n基本的な機能\n\n\nMarkdownエディタ: ObsidianはMarkdownファイルを扱うエディタであり、ユーザーはテキストを簡単にフォーマットできます。Markdownの利点は、シンプルなテキスト形式でありながら、他のツールへのインポートが容易である点です。\n\n\nローカルファースト: データはユーザーのローカル環境に保存され、インターネット接続がなくてもアクセス可能です。これにより、データの安全性が高まり、サービス終了のリスクを軽減します。\n\n\nリンク機能: Obsidianでは、ノート間にリンクを作成することができ、情報を相互に関連付けることが可能です。この機能は、思考を整理し、ナレッジを構築するのに役立ちます。\n\n\nプラグインと拡張性\n\n\nプラグインの利用: Obsidianはコアプラグインとコミュニティプラグインを提供しており、ユーザーは必要に応じて機能を追加できます。これにより、個々のニーズに合わせたカスタマイズが可能です。\n\n\nグラフビュー: ノート間のリンクを視覚的に表示するグラフビュー機能があり、思考の構造を視覚化することができます。これにより、情報の関連性を直感的に理解しやすくなります。\n\n\nプラットフォームと同期\n\n\nマルチプラットフォーム対応: ObsidianはWindows、Mac、Linux、iOS、Androidに対応しており、さまざまなデバイスで利用できます。\n\n\n同期機能: Obsidian Syncという有料サービスを利用することで、異なるデバイス間でノートをシームレスに同期することができます。また、DropboxやOneDriveなどのクラウドストレージを利用して手動で同期することも可能です。\n\n\nまとめ\nObsidianは、個人の知識を整理し、思考を深めるための強力なツールです。Markdown形式のシンプルさと、ローカル保存によるデータの安全性、リンク機能による情報の関連付け、豊富なプラグインによる拡張性が特徴です。これにより、ユーザーは自分のニーズに合わせた柔軟なノート作成が可能となります。\n\nQuartzとは\nQuartzは、Obsidianのノートをウェブサイトとして公開するためのオープンソースツールです。特に、Obsidianの「デジタルガーデン」や個人のメモを簡単にウェブ上に展開できることを目的としています。以下に、Quartzの主な特徴と機能をまとめます。\n主な機能\n\n\nMarkdownのサポート: QuartzはMarkdown形式のコンテンツをHTMLに変換し、ウェブサイトとして表示します。これにより、Obsidianで作成したノートをそのまま利用できます。\n\n\nObsidianとの互換性: QuartzはObsidian Flavored Markdown（OFM）をサポートしており、Obsidianの特有の機能（例えば、ウィキリンクやMermaidダイアグラム）をそのまま利用できます。\n\n\nカスタマイズ可能なリンク解決: Quartzは、Obsidianのリンク解決の動作をカスタマイズするためのプラグインを提供しており、ユーザーは自分のニーズに合わせて設定を変更できます。\n\n\nGitHubとの統合: QuartzはGitHubと連携し、ノートのバージョン管理や公開を容易にします。ユーザーはGitHub Actionsを利用して、定期的にノートを更新したり、S3バケットと同期させたりすることができます。\n\n\n利用方法\n\n\nセットアップ: Quartzを使用するには、まずGitHub上にリポジトリを作成し、Obsidianのノートをそのリポジトリにコピーします。これにより、公開用のリポジトリを別に持つことができ、プライバシーを保ちながらノートを公開できます。\n\n\n公開: Quartzを使って生成されたウェブサイトは、GitHub Pagesなどのホスティングサービスを利用して公開できます。これにより、無料で自分のノートをウェブ上に展開することが可能です。\n\n\nカスタマイズ: ユーザーはQuartzのテーマや設定を変更し、自分のスタイルに合わせたウェブサイトを作成できます。これには、メタデータの表示やリンクのカスタマイズが含まれます。\n\n\nまとめ\nQuartzは、Obsidianユーザーにとって非常に便利なツールであり、ノートを簡単にウェブ上に公開できる機能を提供します。特に、MarkdownのサポートやObsidianとの高い互換性により、ユーザーは自分の知識を効果的に共有することができます。無料で利用できる点も大きな魅力です。\n"},"Index":{"title":"INDEX","links":[],"tags":[],"content":"/content\nINDEX\n\n\n                  \n                  NOTE\n                  \n                \n\n⛔️ テンプレートであるため、これらのリソースはダミーです\n\n\nINDEX \nLinks \nObsidian &amp; Quartz\nデバイス内のObsidian書庫を”content”ディレクトリに指定して使用してください\n"},"Links":{"title":"Links","links":[],"tags":[],"content":"URL"}}